       IDENTIFICATION DIVISION.
       PROGRAM-ID. ELECTION.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ELECTIONFL ASSIGN TO 'C:/Users/HP PC/ELECTION.txt'
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS WS-ELECTIONFL-STATUS.

           SELECT ELECTIONFL1 ASSIGN TO 'C:/Users/HP PC/ELE1.txt'
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS WS-ELECTIONFL1-STATUS.

           SELECT ELECTIONFL2 ASSIGN TO 'C:/Users/HP PC/ELE2.txt'
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS WS-ELECTIONFL2-STATUS.


       DATA DIVISION.
       FILE SECTION.
       FD  ELECTIONFL.
       01  ELECTIONFL-REC.
           05     NAME        PIC X(03).
           05     AGE         PIC 9(02).
           05     SEX         PIC X(01).
           05     LOACTION    PIC X(10).
           05     VOTED       PIC X(01).
           05 FILLER          PIC X(51).
       FD  ELECTIONFL1.
       01  ELECTIONFL1-REC.
           05     NAME        PIC X(03).
           05     AGE         PIC 9(02).
           05     SEX         PIC X(01).
           05     LOACTION    PIC X(10).
           05     VOTED       PIC X(01).
           05     FILLER      PIC X(51).
       FD  ELECTIONFL2.
       01  ELECTIONFL2-REC.
           05     NAME        PIC X(03).
           05     AGE         PIC 9(02).
           05     SEX         PIC X(01).
           05     LOACTION    PIC X(10).
           05     VOTED       PIC X(01).
           05     FILLER      PIC X(51).

       WORKING-STORAGE SECTION.
       01  WS-FILE-STATUS.
           05  WS-ELECTIONFL-STATUS          PIC X(2).
           5   WS-ELECTIONFL1-STATUS         PIC X(2).
           5   WS-ELECTIONFL2-STATUS         PIC X(2).

       77  WS-ELE-EOF                        PIC X(1)    VALUE  'N'.
       01  WS-COUNTERS.
           05 WS-ELECTIONFL-STATUS-RD-CNT    PIC 9(4)    VALUE ZEROES.
           05 WS-ELECTIONFL1-STATUS-WT-CNT   PIC 9(4)    VALUE ZEROES.
           05 WS-ELECTIONFL2-STATUS-WT-CNT   PIC 9(4)    VALUE ZEROES.

       PROCEDURE DIVISION.
       0000-MAIN-PARA.
           PERFORM 1000-ELECTIONFL-OPEN-PARA.
           IF WS-ELECTIONFL-STATUS = '00' THEN
              PERFORM 2000-ELECTIONFL-READ-PARA  UNTIL WS-ELE-EOF = 'Y'
              PERFORM 3000-ELECTIONFL-CLOSE-PARA
           ELSE
               DISPLAY 'FILE CANNOT BE OPENED.'

           END-IF.
           DISPLAY 'NO OF RECORD READ: ',WS-ELECTIONFL-STATUS-RD-CNT.
           DISPLAY 'NOOFRECORDS WRITTERN:',WS-ELECTIONFL1-STATUS-WT-CNT.
           DISPLAY 'NOOFRECORDS WRITTERN:',WS-ELECTIONFL2-STATUS-WT-CNT.
           STOP RUN.
       1000-ELECTIONFL-OPEN-PARA.
           OPEN INPUT ELECTIONFL
           DISPLAY'FILE STATUS', WS-ELECTIONFL-STATUS.
           OPEN OUTPUT ELECTIONFL1
           DISPLAY'FILE STATUS', WS-ELECTIONFL1-STATUS.

           OPEN OUTPUT ELECTIONFL2
           DISPLAY'FILE STATUS', WS-ELECTIONFL2-STATUS.
       2000-ELECTIONFL-READ-PARA.
           READ ELECTIONFL INTO  ELECTIONFL-REC
             AT END
             MOVE 'Y'TO WS-ELE-EOF
             NOT AT END
              ADD 1 TO WS-ELECTIONFL-STATUS-RD-CNT
             IF AGE OF ELECTIONFL-REC>18 THEN
                 PERFORM  2500-ELECTIONFL1-WRITE-PARA
                 END-IF
              IF AGE OF ELECTIONFL-REC<=18 THEN
                   PERFORM  2600-ELECTIONFL2-WRITE-PARA
                   END-IF
           DISPLAY ELECTIONFL-REC
           END-READ.
       2500-ELECTIONFL1-WRITE-PARA.
           MOVE CORRESPONDING ELECTIONFL-REC TO ELECTIONFL1-REC.
           WRITE ELECTIONFL1-REC.
           ADD 1 TO WS-ELECTIONFL1-STATUS-WT-CNT.
       2600-ELECTIONFL2-WRITE-PARA.
           MOVE CORRESPONDING ELECTIONFL-REC TO ELECTIONFL2-REC.
           WRITE ELECTIONFL2-REC.
           ADD 1 TO WS-ELECTIONFL2-STATUS-WT-CNT.
       3000-ELECTIONFL-CLOSE-PARA.
           CLOSE ELECTIONFL.
           CLOSE ELECTIONFL1.
           CLOSE ELECTIONFL2.
