       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRG2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  TUNITS   PIC     9(5)V99.
       77  RPU     PIC     9(5)V99.
       77  TOTAL   PIC     ZZ9(5)V99.
       77  FORMATTED-TOTAL   PIC  ZZZ9.99.
       PROCEDURE DIVISION.
       0000-MAIN-PARA.
           MOVE 5 TO TUNITS.
           MOVE 3.50 TO RPU.
           COMPUTE TOTAL = TUNITS * RPU.
           MOVE TOTAL TO FORMATTED-TOTAL.
           DISPLAY 'TOTAL:',TOTAL.
           DISPLAY 'FORMATTED-TOTAL:',FORMATTED-TOTAL.
           STOP RUN.
