       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRG3.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77   BEVERAGES          PIC     9(5)V99.
       77   DRESSMATERIALS     PIC     9(6)v99.
       77   COSMETICS          PIC     9(6)V99.
       77   TOTALBEV           PIC     9(5)V99.
       77   TOTALDRESS         PIC     9(6)V99.
       77   TOTALCOSMET     PIC     9(6)V99.
       77     FORMATTED-TOTALBILL        PIC     ZZZ.99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.

            DISPLAY 'ENETR COST OF BEVERAGES'
           ACCEPT BEVERAGES.


           DISPLAY 'ENTER COST OF DRESSMATERIALS'
           ACCEPT DRESSMATERIALS.
           DISPLAY 'ENTER COST OF COSMETICS'
           ACCEPT COSMETICS.

           COMPUTE TOTALBEV=BEVERAGES*10/100.
           DISPLAY 'TOTALBEV',   TOTALBEV.
           COMPUTE  TOTALDRESS=DRESSMATERIALS*5/100.
           DISPLAY 'TOTALDRESS',   TOTALDRESS.
           COMPUTE  TOTALCOSMET=COSMETICS*3/100.
           DISPLAY 'TOTAL',   TOTALBEV.
           COMPUTE FORMATTED-TOTALBILL=TOTALBEV+TOTALDRESS+TOTALCOSMET.
           DISPLAY 'TOTALBILL::',  FORMATTED-TOTALBILL.

           STOP RUN.
