       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRG4.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  RADIUS  PICTURE 9(5)V99.
       77  PI      PICTURE 9(5)V99.
       77  TOTAL    PICTURE 9(5)V99.
       77  FORMATTED-TOTAL   PIC  Z9.99.
       PROCEDURE DIVISION.
       0000-MAIN-PARA.
           MOVE 5 TO RADIUS.
           MOVE 3.14 TO PI.
           COMPUTE TOTAL = PI * RADIUS * RADIUS.
           MOVE TOTAL TO FORMATTED-TOTAL.
           DISPLAY 'TOTAL:',TOTAL.
           DISPLAY 'FORMATTED-TOTAL: ', FORMATTED-TOTAL.
           STOP RUN.
